//
//  Capture8.m
//  Example0
//
//  Created by lmg on 2018/10/12.
//  Copyright © 2018 lmg. All rights reserved.
//

#import "Capture8.h"

@implementation Capture8
/*
 == 比较的是两个指针本身，而不是其所指的对象
 isEqual来判断对象的等同性
 
 
 -----------------------------------------------------------------
 //总结
 -----------------------------------------------------------------
 1.若想检测对象的等同性，请提供isEqual与hash方法
 2.相同的对象必须具有相同的hash值，但是两个hash值相同的对象却未必相同
 3.不要盲目的逐个检测每条属性，而是应该依照具体需求来指定检测方案
 4.编写hash方法时，应该使用计算速度快并且哈希码碰撞几率低的算法
 
 */
@end
